0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0.1183 0 0);

boundaryField
{
    Wall
    {
        type            noSlip;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform (0.1183 0 0);
        value           uniform (0.1183 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    Top
    {
        type            symmetry;
    }
    Bottom
    {
        type            symmetry;
    }
    Side
    {
        type            empty;
    }
}

// ************************************************************************* //
