0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 1;

boundaryField
{
    Wall
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 1;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Top
    {
        type            symmetry;
    }
    Bottom
    {
        type            symmetry;
    }
    Side
    {
        type            empty;
    }
}


// ************************************************************************* //
