system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     rhoEnergyFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1677;

deltaT          0.000000000001;

writeControl    	adjustableRunTime;

writeInterval   	1;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	true;

adjustTimeStep  	yes;

maxCo          		1.0;

maxDeltaT       	0.001;

pressArtDiff    	true; //activate artificial diffusion on pressure
convArtDiff     	false; //activate artificial diffusion on pressure

ku        		0.25;
kp        		0.25;
ducLevelPress       	0.00; // pressure diffusion threshold 
ducLevelConv        	0.05; // convective diffusion threshold
epsilon             	0.01399; // u_infty^2
minfty              	0.1; // Reference Mach number needed by AUSM flux (free stream Mach number)

functions
{



    fieldAverage
    {
        type            fieldAverage;
        libs 		("libfieldFunctionObjects.so");
        enabled         false;
        writeControl    outputTime;

	//writeControl   timeStep;
	//writeInterval  100;

	//cleanRestart true;

	timeStart       800;
	timeEnd         1000;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }



    forceCoeffs_object
    {
	// rhoInf - reference density
	// CofR - Centre of rotation
	// dragDir - Direction of drag coefficient
	// liftDir - Direction of lift coefficient
	// pitchAxis - Pitching moment axis
	// magUinf - free stream velocity magnitude
	// lRef - reference length
	// Aref - reference area
	type forceCoeffs;
	libs ("libforces.so");
	patches (Wall);

	pName p;
	UName U;

	//rho rhoInf;
	rhoInf 1;

	//// Dump to file
	log true;

	CofR (0.0 0 0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 150;
	lRef 1;         // reference lenght for moments!!!
	Aref 1;         // reference area 1 for 2d

        writeControl   timeStep;
        writeInterval  1;
    }


}
